<?php
/**
 * Sneaker - a business framework based on Slim
 *
 * Configuration for error code
 *
 * @author      Linvo <linvo@foxmail.com>
 * @copyright   2015 Linvo
 * @version     0.0.1
 * @package     conf
 */


/**
 * Configuration for errcode
 */

$app->config('errcode', [
	//1100-1199    因为调用方式等原因导致的错误
	1100 => 'uri地址不合法',
    1101 => '参数{%s}不能为空',
    1102 => '参数{%s}不合法',
    1103 => '该资源不支持此操作',
	1104 => '平台不合法',
	1105 => 'state不合法',
	//1200-6999  业务中产生的正常错误

	//1200-1299  系统功能相关错误
	1200 => '有已存在的记录，不能重复添加',
	1201 => '记录已存在，请勿重复添加',
	1210 => '记录不存在',
	1211 => '单据号不存在',
			
	//1300-1399  员工和角色权限相关错误
	1300 => '用户不存在',
	1301 => '用户已经被禁用',
	1302 => '用户密码错误',
	1303 => '非ERP用户禁止登陆，请先开通ERP权限',
	1304 => '请先发送验证码',
	1305 => '验证码不正确',
	1306 => '验证码发送失败',
	1307 => '您的账号未录入手机号，请先找管理员录入',
	1308 => '手机号格式错误',
	1309 => '第三方帐号未绑定帐号，登录失败',

//	1321 => '无权操作该数据',
	1322 => '不是该公司员工',
//	1323 => '没有该仓库权限',

	1330 => '角色所选模块不存在',
	1331 => '角色不存在',
	
	1340 => '员工所属部门不存在',
	1341 => '员工所属角色不存在',
	1342 => '员工不存在',
	1343 => '员工仓库权限错误',
	1344 => '创建员工必须使用管理员账户操作',
	1345 => '该号码已经存在',
	1346 => '系统角色不允许修改',
	1347 => '不可操作其它公司员工的信息',
	1348 => '管理员不可以删除自己',
	1349 => '员工姓名已存在',
	1350 => '员工尚有客户，请先移交客户',
	
	//1400-1499 商品相关错误
	1400 => '商品品牌存在相关商品，不可被删除',
	1401 => '商品品牌不存在',
	1402 => '商品品牌名称已存在',
		
	1410 => '商品类型存在相关商品，不可被删除',
	1411 => '要删除的商品类型不存在',
	1412 => '商品类型存在子类型，不可被删除',
	1413 => '类型已满，无法再继续创建',
	1414 => '所属的父类型不存在',
	
	1420 => '该商品存在库存，不可被删除',
	1421 => '商品类型不存在',
	1422 => '商品品牌不存在',
	1423 => '商品不存在',
	1424 => '商品条码已经存在',

	1430 => '要绑定的大包装商品不存在',
	1431 => '要绑定的大包装商品不是大包装属性',
	1432 => '要绑定的基本包装商品不存在',
	1433 => '要绑定的基本包装商品不是基本包装属性',
	1434 => '要绑定的大包装商品已经存在绑定关系',

	1440 => '捆绑关系不存在',

	1450 => '不能操作不属于本公司的商品',
	
	1470 => '出货仓库不属于出货公司',
	1471 => '商品价格记录不存在',
	//1600-1699 仓库相关错误
//	1600 => '没有[{%s}]仓库权限',
	1601 => '仓库不存在',
	1602 => '无法操作其它公司的仓库',
	1603 => '仓库名称已存在',
	1610 => '该仓库未开启库存管理功能',

	//1700-1799 公司相关错误
	1700 => '公司还有库存，不可被删除',
	1701 => '公司还有所属员工，不可被删除',
	1702 => '公司不存在',
	1703 => '名称已存在',
	1704 => '税号已存在',
	1705 => '营业执照已存在',

	1710 => '公司未授权，不可操作',
	1720 => '无法添加自己公司为客户',
	1730 => '无法添加自己公司为供应商',
	1740 => '无权进行此操作',
	1741 => '该公司为ERP公司',

	1750 => '该业务员已经添加，无法重复添加',
	1751 => '该客户已经有自有业务员，无法再添加自有业务员',
	1752 => '自有业务员无法删除，请移交客户',
	1753 => '当前默认业务员是自有业务员，无法进行业务员转移操作',
	1754 => '自有业务员和外借业务员之间无法移交客户',
	1755 => '当前业务员已经是默认业务员',
	1756 => '自己不能移交给自己',

	//1800-1899 车辆错误
	1800 => '车牌号已存在',
	1801 => '车辆不存在',

	//3000-3999 单据相关错误
    3000 => '单据不存在',
    3001 => '请限定公司或仓库范围',
    3002 => '商品列表格式错误',
    3003 => '商品均未找到',
    3004 => '您有未选择的商品',
	3005 => '商品数量不合法',
	3006 => '商品单价不合法',
	3007 => '下单机构和仓库不匹配',
	3008 => '商品[{%s}]尚未添加',
	3010 => '商品清单不可为空',
	3011 => '该供应商下面没有商品',
	3012 => '没有向该供应商进货记录，无法进行退货操作',
	3100 => '订单号不存在',
	3101 => '该订单不属于本机构',
	3102 => '该订单类型不正确，无法进行相关操作',
	3103 => '该订单状态不正确，无法进行相关操作',
	3104 => '该订单已经生成入库单，无法进行操作',
	3105 => '该订单已经生成出库单，无法进行操作',
	3106 => '调入仓库不可与调出仓库相同',
	3107 => '商品列表中包含已停用采购功能的商品',
	3108 => '该订单已作废',
	3109 => '该调拨单尚未出库，无法冲正',
	3110 => '入库单号不存在',
	3111 => '该入库单不属于本机构',
	3112 => '该入库单类型不正确，无法进行相关操作',
	3113 => '该入库单状态不正确，无法进行相关操作',
	3114 => '单据无改动，不需要进行修正',
	3115 => '拆单商品数量不能超过原单据',

	3120 => '出库单号不存在',
	3121 => '该出库单不属于本机构',
	3122 => '该出库单类型不正确，无法进行相关操作',
	3123 => '该出库单状态不正确，无法进行相关操作',
	3124 => '商品[{%s}]库存不足，无法出库',
	3125 => '商品[{%s}]指定批次库存不足，无法出库',
	3126 => '单据结算状态不正确',
	3127 => '单据已经结算，不可作废',

	3130 => '报溢单不存在',
	3131 => '报溢单不属于本机构',
	3132 => '该报溢单类型不正确，无法进行相关操作',
	3133 => '该报溢单状态不正确，无法进行相关操作',
	3140 => '报损单不存在',
	3141 => '报损单不属于本机构',
	3142 => '该报损单类型不正确，无法进行相关操作',
	3143 => '该报损单状态不正确，无法进行相关操作',

	3201 => '调价时间不能小于当前时间',
	3202 => '调价单不存在',
	3203 => '该调价单不属于本机构',
	3204 => '调价单状态不正确，无法进行相关操作',
	3205 => '调价单类型不正确，无法进行相关操作',
	3206 => '调价单中包含重复的单据',

	3210 => '该业务员已经存在本年度的任务',
	3211 => '任务商品不能包含重复的商品',

	3300 => '没有商品',
	3301 => '没有正在盘点的帐盘，请先新建帐盘',
	3302 => '盘点单不存在',
	3303 => '该盘点单不属于本机构',
	3304 => '盘点单状态不正确，无法进行相关操作',
	3305 => '当前存在为负数的实盘数，无法进行记账操作',
	3306 => '商品[{%s}]实盘数不足',

	3402 => '结算单不存在',
	3403 => '该结算单不属于本机构',
	3404 => '结算单状态不正确，无法进行相关操作',
	3405 => '结算优惠金额不能大于原金额',
	3406 => '结算金额不能为负数',
	3407 => '线上支付结算单不可冲单',
	3408 => '结算单类型不正确',
	3409 => '结算单包含已经提成的单据，无法进行冲单',

	3410 => '只能冲正最近的一笔代销结算单',
	3411 => '本次结算日期不能小于上次结算日期',

	3502 => '收款单不存在',
	3503 => '该收款单不属于本机构',
	3504 => '收款单状态不正确，无法进行相关操作',

	3602 => '付款单不存在',
	3603 => '该付款单不属于本机构',
	3704 => '付款单状态不正确，无法进行相关操作',

	3801 => '付款金额不正确',
	3901 => '单据中包含已经提成的内容，无法继续操作',

	3910 => '客服回访记录不存在',
	3911 => '客服回访记录类型错误',
	3990 => '没有改记录权限',
	//4000-4999 报表统计相关错误

	//5000-5999 商城接口错误
	5100 => '订单已存在，请勿重复下单',
	5101 => '公司下没有仓库，不可操作',

	//6000-6199 业务员APP错误
	6010 => '没有相应权限',
	//6200-6399 客户APP错误
	6200 => '微信返回错误[{%s}]',
	6210 => '帐号不存在',
	6211 => '帐号已经绑定第三方帐号，无法重复绑定',
	6212 => 'openid已绑定，无法重复绑定',
	6213 => '您暂不是该企业的客户',

	6230 => '不在会销期间',
	6231 => '会销码错误',

	6310 => '批价失败，产品不存在',
	6311 => '剩余天数不足以支持会员等级转换',
	6312 => '转换失败，该会员等级不支持转换',
	6313 => '转换失败，只能向更高级会员转换',
	6314 => '您暂不是该企业会员',

	//8000-8999 致命错误，需呀前端终止流程	
	8000 => '账号已退出，请重新登录',
	8001 => '账号已退出，请重新登录',
	8002 => '您的帐号已在别处登录', //未用到
	8003 => 'ticket参数不可为空',


	//8100-8109 功能权限错误
	8100 => '无权进行该操作',
	//8110-8119 数据权限错误
	8110 => '无权操作该公司数据',
	8111 => '无权操作仓库[{%s}]',

	//9900-9999  系统服务错误
	9900 => 'Operating database error',
	9901 => 'Unsupported order type',
	9902 => 'Create bill fail',
	9903 => 'Update bill fail',
	9904 => 'Queue error',


	9910 => 'quartz service error:errcode:[{%s}]',
	9920 => 'notice ofc order error:errorcode:[{%s}]',
	9930 => 'openssl_private_decrypt failed',
	9999 => 'System Error:[{%s}]',

	//微信支付相关错误码
	7100 => '此商户暂未开通银行转账功能',
	7101 => '订单参数[{%s}]错误',
	7102 => '该客户不允许购买该商品',
	7103 => '下单失败',
	7104 => '该商品[{%s}]不属于该供应商',
	7105 => '{%s}',
	7106 => '{%s}',
	7107 => '{%s}',
	300  => '{%s}',
	7108 => '该VIP产品不存在',
 ]);

